STM32-SDR/STM32-SDR/STM32-SDR/externals/SM32F4-Discovery/STEmbeddedGUI/inc/LcdDriver_ILI9320.h
#ifndef __LCDDRIVER_ILI9320_H
#define __LCDDRIVER_ILI9320_H

#ifdef __cplusplus
extern "C" {
#endif


#include "stm32_eval.h"


/*
 * LCD Colours
 */
#define LCD_COLOR_WHITE          0xFFFF
#define LCD_COLOR_BLACK          0x0000
#define LCD_COLOR_GREY           0xF7DE
#define LCD_COLOR_LGRAY          0xC618
#define LCD_COLOR_DGRAY          0x7BEF
#define LCD_COLOR_DGREEN         0x03E0
#define LCD_COLOR_DCYAN          0x03EF
#define LCD_COLOR_MAROON         0x7800
#define LCD_COLOR_PURPLE         0x780F
#define LCD_COLOR_OLIVE          0x7BE0
#define LCD_COLOR_BLUE           0x001F
#define LCD_COLOR_BLUE2          0x051F
#define LCD_COLOR_NAVY           0x000F
#define LCD_COLOR_RED            0xF800
#define LCD_COLOR_MAGENTA        0xF81F
#define LCD_COLOR_GREEN          0x07E0
#define LCD_COLOR_CYAN           0x7FFF
#define LCD_COLOR_YELLOW         0xFFE0


// From LcdHal.h
#define LCD_ILI9320 0x9320
#define LCD_SPFD5408 0x5408
extern __IO uint32_t LCDType;



// Actual screen size:
#define LCD_ACTUAL_SCREEN_WIDTH  ((uint16_t) 240)
#define LCD_ACTUAL_SCREEN_HEIGHT ((uint16_t) 320)

/**
 * LCD_Direction_TypeDef enumeration definition
 */
// Set to 0, 90, 180, or 270
#define LCD_ROTATION 270
#if LCD_ROTATION == 0
	#define LCD_HEIGHT  LCD_ACTUAL_SCREEN_HEIGHT
	#define LCD_WIDTH   LCD_ACTUAL_SCREEN_WIDTH
#elif LCD_ROTATION == 90
	#define LCD_HEIGHT  LCD_ACTUAL_SCREEN_WIDTH
	#define LCD_WIDTH   LCD_ACTUAL_SCREEN_HEIGHT
#elif LCD_ROTATION == 180
	#define LCD_HEIGHT  LCD_ACTUAL_SCREEN_HEIGHT
	#define LCD_WIDTH   LCD_ACTUAL_SCREEN_WIDTH
#elif LCD_ROTATION == 270
	#define LCD_HEIGHT  LCD_ACTUAL_SCREEN_WIDTH
	#define LCD_WIDTH   LCD_ACTUAL_SCREEN_HEIGHT
#else
	#error Must define LCD_ROTATION to be a direction
#endif



// TODO: Remove these.
#define LCD_DIR_HORIZONTAL       0x0000
#define LCD_DIR_VERTICAL         0x0001

// Directions used for creating a line. Specify the start point, and then the direction.
typedef enum
{
	LCD_WriteRAMDir_Right = 0,
	LCD_WriteRAMDir_Down,
	LCD_WriteRAMDir_Left,
	LCD_WriteRAMDir_Up
} LCD_WriteRAM_Direction;


// TODO: Remove?
void LCD_WriteRAMWord(uint16_t RGB_Code);
void LCD_DrawColorBMP(uint8_t* ptrBitmap, uint16_t Xpos_Init, uint16_t Ypos_Init, uint16_t Height, uint16_t Width);


uint16_t LCD_ReadReg(uint8_t LCD_Reg);
uint16_t LCD_ReadRAM(void);
void LCD_PutPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color);
uint16_t LCD_GetPixel(uint16_t Xpos, uint16_t Ypos);













// From TFT_Display.h
//void LCD_Reset(void);
void LCD_Init(void);
//void TIM_Config(void);
//void LCD_CtrlLinesConfig(void);
//void LCD_FSMCConfig(void);
//
//void TFT_Delay(__IO uint32_t nTime);
//
//void PutPixel(int16_t x, int16_t y);
//
//void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor);
//void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor);
void LCD_SetTextColor(__IO uint16_t Color);
void LCD_SetBackColor(__IO uint16_t Color);
void LCD_Clear(uint16_t Color);
//void LCD_CharSize(__IO uint16_t size);
//void Pixel(int16_t x, int16_t y, int16_t c);
//
//void LCD_DrawFFT(uint8_t fftData[]);
//void LCD_PutChar(int16_t PosX, int16_t PosY, char c);
//void LCD_StringLine(uint16_t PosX, uint16_t PosY, char *str);
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction);
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width);
//void LCD_DrawSquare(uint16_t Xpos, uint16_t Ypos, uint16_t a);
//void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius);
//
//void LCD_DrawUniLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2);
//void LCD_DrawFullRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height);
//void LCD_DrawFullCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius);
//void LCD_PolyLine(pPoint Points, uint16_t PointCount);
//void LCD_PolyLineRelative(pPoint Points, uint16_t PointCount);
//void LCD_ClosedPolyLine(pPoint Points, uint16_t PointCount);
//void LCD_ClosedPolyLineRelative(pPoint Points, uint16_t PointCount);
//void LCD_FillPolyLine(pPoint Points, uint16_t PointCount);
//void LCD_DrawFullSquare(uint16_t Xpos, uint16_t Ypos, uint16_t a);
//

void LCD_DrawBMP16Bit(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revByteOrder);
void LCD_DrawBMP1Bit(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revBitOrder);
void LCD_DrawBMP1BitTransparent(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revBitOrder);


// Low-level access routines.
void LCD_WriteRAM_Prepare(void);
void LCD_WriteRAM(uint16_t RGB_Code);
void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue);
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos);
void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width);

// Setup routines
void LCD_DisplayOn(void);
void LCD_DisplayOff(void);
void LCD_BackLight(int procentai);

//
//void Display_ULong(uint16_t data, uint8_t XL, uint8_t YL);
//
//void Plot_String(uint8_t *string, uint8_t x, uint8_t y);
//void Plot_Integer(int16_t number, uint8_t x, uint8_t y);
//void Plot_Freq(uint32_t number, uint8_t x, uint8_t y, uint32_t changeRate);

uint16_t LCD_ReadReg(uint8_t LCD_Reg);

void LCD_TestDisplayScreen(void);



#ifdef __cplusplus
}
#endif

#endif
